<?xml version = "1.0" encoding = "UTF-8" ?>
<xsl:stylesheet version = "1.0"	xmlns:xsl = "http://www.w3.org/1999/XSL/Transform">
  <!-- определяем переменные -->
  <xsl:variable name="tab">
    <xsl:text>&#x09;</xsl:text>
  </xsl:variable>
  <xsl:template match ="/">    

	<html>
	<head>
	    <title>Сокращенный перечень РМ</title>
    <style>
      /* Style Definitions */
      body
      {
      font-size:10.0pt;
      font-family: Times new roman, serif;
      text-align:left;
      }
      p.h1 {
      font-weight:bold;
      font-size:14.0pt;
      text-align:center;
      }
      p.h2 {
      font-weight:bold;
      font-size:12.0pt;
      text-align:left;
      margin-top:6pt;
      margin-bottom:6pt;
      }
      p.h3 {
      font-weight:bold;
      font-size:11.0pt;
      text-align:left;
      margin-top:0pt;
      margin-bottom:3pt;
      }
      p.zone {
      margin-top:0pt;
      margin-bottom:0pt;
      }
      p.factor {
      margin-top:0pt;
      margin-bottom:0pt;
      }
      table,th,td {
      border:1px solid black;border-collapse:collapse;padding:0 5px 0 5px;
      }
      td.center {
      text-align:center;
      }
      table.empty,table.empty th,table.empty td
      {
      border:none;
      background:none;
      padding:0 5px 0 5px;
      }
      td.h30 {
      height:30pt;
      }
    </style>	
  </head>
	<body>
        <xsl:apply-templates/>
	</body>
	</html>
  </xsl:template>

  <xsl:template match ="Document">
    <p class="h1" >РАБОЧАЯ ТЕТРАДЬ</p>
    <p>
      Дата / №:     1) "___"______ <xsl:value-of select="@izm_year"/> г., 2) "___"______ <xsl:value-of select="@izm_year"/> г., 3) "___"______ <xsl:value-of select="@izm_year"/> г., 4) "___"______ <xsl:value-of select="@izm_year"/> г., 5) "___"______ <xsl:value-of select="@izm_year"/> г., 6) "___"______ <xsl:value-of select="@izm_year"/> г.,<br/>
      Наименование объекта, фактический адрес:<xsl:value-of select="@org_name"/>; <xsl:value-of select="@org_adr"/><br/>
      Измерения вредных производственных факторов выполнены для целей специальной оценке условий труда.
    </p>
    <xsl:apply-templates select="si_data"/>
    <xsl:apply-templates select="podr|rm"/>
  </xsl:template>

  <xsl:template match ="si_data">
    <p>
      <b>Перечень используемых СИ:</b>
      <br/>
      <xsl:apply-templates select="si"/>
    </p>
  </xsl:template>
  
  <xsl:template match ="si">
    <xsl:value-of select="@name"/>;<br/>
  </xsl:template>

  <xsl:template match ="podr">
    <p class="h2" >
      <xsl:value-of select="@name"/>
    </p>
  </xsl:template>  

  <xsl:template match ="rm">
    <hr/>
    <p class="h3">
      <xsl:value-of select="@rm_code"/>. <xsl:value-of select="@rm_name"/>
      <xsl:apply-templates select="zone"/>
    </p>
    <!-- Факторы трудового процесса-->
    <xsl:if test="@tyag='true' or @napr='true'">
      <hr/>
      <p class="h2">
        Факторы трудового процесса для рабочего места:
      </p>
    </xsl:if>
    <xsl:if test="@tyag='true' and @tyag_wide_mode!='true'">

      <p class="factor">
        <b>Тяжесть трудового процесса</b>
      </p>
      <table width="100%">
        <tr>
          <td class="h30" width="20%">1.Физическая динамическая  нагрузка за смену, кг.м</td>
          <td width="80%"></td>
        </tr>
        <tr>
          <td class="h30">2. Масса поднимаемого и перемещаемого груза вручную, кг</td>
          <td></td>
        </tr>
        <tr>
          <td class="h30">3. Стереотипные рабочие движения</td>
          <td></td>
        </tr>
        <tr>
          <td class="h30">4. Статическая нагрузка</td>
          <td></td>
        </tr>
        <tr>
          <td class="h30">5. Рабочая поза, % смены</td>
          <td></td>
        </tr>
        <tr>
          <td class="h30">6. Наклоны корпуса</td>
          <td></td>
        </tr>
        <tr>
          <td class="h30">7. Перемещение в пространстве, км</td>
          <td></td>
        </tr>
      </table>
    </xsl:if>
    
    <xsl:if test="@tyag='true' and @tyag_wide_mode='true'">

      <p class="factor">
        <b>Тяжесть трудового процесса</b>
      </p>
      <table width="100%">
        <tr>
          <td class="h30">Показатель</td>
          <td width="40%" align="center">для мужчин</td>
          <td width="40%" align="center">для женщин</td>
        </tr>
        <tr>
          <td class="h30" width="20%">1.Физическая динамическая  нагрузка за смену, кг.м</td>
          <td width="40%"></td>
          <td width="40%"></td>
        </tr>
        <tr>
          <td class="h30">2. Масса поднимаемого и перемещаемого груза вручную, кг</td>
          <td width="40%"></td>
          <td width="40%"></td>
        </tr>
        <tr>
          <td class="h30">3. Стереотипные рабочие движения</td>
          <td width="40%"></td>
          <td width="40%"></td>
        </tr>
        <tr>
          <td class="h30">4. Статическая нагрузка</td>
          <td width="40%"></td>
          <td width="40%"></td>
        </tr>
        <tr>
          <td class="h30">5. Рабочая поза, % смены</td>
          <td width="40%"></td>
          <td width="40%"></td>
        </tr>
        <tr>
          <td class="h30">6. Наклоны корпуса</td>
          <td width="40%"></td>
          <td width="40%"></td>
        </tr>
        <tr>
          <td class="h30">7. Перемещение в пространстве, км</td>
          <td width="40%"></td>
          <td width="40%"></td>
        </tr>
      </table>
    </xsl:if>

    <xsl:if test="@napr='true'">
      <p class="factor">
        <b>Напряженность трудового процесса</b>
      </p>
      <table width="100%">
        <tr>
          <td class="h30" width="20%">Плотность сигналов и сообщений в среднем за 1 ч, ед.</td>
          <td width="80%"></td>
        </tr>
        <tr>
          <td class="h30">Число объектов одновременного наблюдения, ед.</td>
          <td></td>
        </tr>
        <tr>
          <td class="h30">Работа с оптическими приборами (% времени смены)</td>
          <td></td>
        </tr>
        <tr>
          <td class="h30">Нагрузка на голосовой аппарат, час</td>
          <td></td>
        </tr>
        <tr>
          <td class="h30">Число элементов (приемов), необходимых для реализации …, ед.</td>
          <td></td>
        </tr>
        <tr>
          <td class="h30">Монотонность (время пассивного наблюдения в % от времени смены)</td>
          <td></td>
        </tr>
      </table>
    </xsl:if>

  </xsl:template>

  <xsl:template match ="zone">
    <p class="zone">
      <hr/>
      <b>Рабочая зона: </b><xsl:value-of select="@name"/><b>;&#160;&#160;&#160;&#160;&#160;Время: </b><xsl:value-of select="@time"/>%.<br/>
      <b>Условия измерения: </b>температура:__________ влажность:__________ скорость возд.:__________ давление:__________ <br/>
      Доп. сведения о рабочей зоне:<br/><br/>
    </p>
    <!-- Хим.фактор-->
    <xsl:apply-templates select="him"/>
    <!-- Аэрозоли ПФД-->
    <xsl:apply-templates select="apfd"/>

    <xsl:if test="@shum='true'">
      <!-- Здесь можно отредактировать сведения по шуму-->
      <p class="factor">
        <hr/>
        <b>Шум</b>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;Дата (№ даты):<br/>
        <table class="empty" width="100%">
          <tr>
            <td width="70%">Источник:</td>
            <td width="15%">Время:</td>
            <td width="15%">Уровень:</td>
          </tr>
        </table>
      </p>
    </xsl:if>

    <xsl:if test="@infra='true'">
      <!-- Здесь можно отредактировать сведения по инфразвуку-->
      <p class="factor">
        <hr/>
        <b>Инфразвук</b>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;Дата (№ даты):<br/>
        <table class="empty" width="100%">
          <tr>
            <td width="70%">Источник:</td>
            <td width="15%">Время:</td>
            <td width="15%">Уровень:</td>
          </tr>
        </table>
      </p>
    </xsl:if>

    <xsl:if test="@ultra='true'">
      <!-- Здесь можно отредактировать сведения по ультразвуку-->
      <p class="factor">
        <hr/>
        <b>Ультразвук</b>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;Дата (№ даты):<br/>
        <table class="empty" width="100%">
          <tr>
            <td width="55%">Источник:</td>
            <td width="15%">Частота кГц:</td>
            <td width="15%">Время:</td>
            <td width="15%">Уровень:</td>
          </tr>
        </table>
      </p>
    </xsl:if>

    <xsl:if test="@vibr_o='true'">
      <!-- Здесь можно отредактировать сведения по общей вибрации-->
      <p class="factor">
        <hr/>
        <b>Вибрация общая</b>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;Дата (№ даты):<br/>
        <table class="empty" width="100%">
          <tr>
            <td width="60%">Источник:</td>
            <td width="10%">Время:</td>
            <td width="10%">Уровень:</td>
            <td width="7%">X:</td>
            <td width="7%">Y:</td>
            <td width="6%">Z:</td>
          </tr>
        </table>
      </p>
    </xsl:if>

    <xsl:if test="@vibr_l='true'">
      <!-- Здесь можно отредактировать сведения по локальной вибрации-->
      <p class="factor">
        <hr/>
        <b>Вибрация локальная</b>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;Дата (№ даты):<br/>
        <table class="empty" width="100%">
          <tr>
            <td width="60%">Источник:</td>
            <td width="10%">Время:</td>
            <td width="10%">Уровень:</td>
            <td width="7%">X:</td>
            <td width="7%">Y:</td>
            <td width="6%">Z:</td>
          </tr>
        </table>
      </p>
    </xsl:if>


    <xsl:if test="@emp='true'">
      <!-- Здесь можно отредактировать сведения по ЭМП-->
      <p class="factor">
        <hr/>
        <b>ЭМП</b>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;Дата (№ даты):<br/>
        <table class="empty" width="100%">
          <tr>
            <td width="50%">Вид ЭМП (частота):</td>
            <td width="10%">Время:</td>
            <td width="10%">Уровень:</td>
            <td width="10%">h-0.5:</td>
            <td width="10%">h-1.0:</td>
            <td width="10%">h-1.5:</td>
          </tr>
        </table>
        Доп. сведения:
      </p>
    </xsl:if>

    <xsl:if test="@rad='true'">
      <!-- Здесь можно отредактировать сведения по Ионизиирующее излучение-->
      <p class="factor">
        <hr/>
        <b>Ионизиирующее излучение</b>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;Дата (№ даты):<br/>
        <table class="empty" width="100%">
          <tr>
            <td width="55%">Источник:</td>
            <td width="15%">Персонал (А или Б):</td>
            <td width="10%">Время:</td>
            <td width="20%">Мощность дозы, мкЗв/час:</td>
          </tr>
        </table>
        Доп. сведения:
      </p>
    </xsl:if>


    <xsl:if test="@ufi='true'">
      <!-- Здесь можно отредактировать сведения по УФ-излучение-->
      <p class="factor">
        <hr/>
        <b>УФ-излучение</b>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;Дата (№ даты):<br/>
        <table class="empty" width="100%">
          <tr>
            <td width="55%">Источник:</td>
            <td width="15%">Тип излучения(A,B,C): </td>
            <td width="10%">Время:</td>
            <td width="20%">Уровень:</td>
          </tr>
        </table>
        Доп. сведения:
      </p>
    </xsl:if>


    <xsl:if test="@osv='true'">
      <!-- Здесь можно отредактировать сведения по световой среде-->
      <p class="factor">
        <hr/>
        <b>Освещение</b>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;Дата (№ даты):<br/><br/>
        Тип ламп:&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;
        Мощн.:&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;
        Освещенность (общ):&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;
        Освещенность (комб.):&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;
        Светильник:<br/>
        Доп. сведения:
      </p>
    </xsl:if>
    
    <xsl:if test="@micro='true'">
      <!-- Здесь можно отредактировать сведения по микроклимату-->
      <p class="factor">
        <hr/>
        <b>Микроклимат</b>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;
        Дата (№ даты):&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;
        Вид микроклимата (обвести): нагревающий / охлаждающий<br/><br/>
        <table width="100%">
        <tr>
          <td width="10%">Высота</td>
          <td width="10%">Темп-ра</td>
          <td width="10%">Скор.возд.</td>
          <td width="10%">Влажность</td>
          <td width="10%">ТНС</td>
          <td width="10%">Тепл.изл.</td>
          <td width="40%">Доп.информация по измерениям</td>
        </tr>
        <tr>
          <td>0.5</td>
          <td></td>
          <td></td>
          <td></td>
          <td></td>
          <td></td>
          <td rowspan="3"></td>
        </tr>
        <tr>
          <td>1.0</td>
          <td></td>
          <td></td>
          <td></td>
          <td></td>
          <td></td>
        </tr>
        <tr>
          <td>1.5</td>
          <td></td>
          <td></td>
          <td></td>
          <td></td>
          <td></td>
        </tr>
      </table>
        Доп. сведения:
      </p>
    </xsl:if>
    </xsl:template>

  <!-- Хим.фактор-->
  <xsl:template match ="him">
    <hr/>
    <p class="factor">
      <b>Химический фактор: </b><u><xsl:value-of select="@name"/></u>
      &#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;Дата (№ даты):<br/><br/>
      Подчеркнуть:&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;
      Улица&#160;&#160;&#160;&#160;&#160;С вентиляцией&#160;&#160;&#160;&#160;&#160;Без вентиляции&#160;&#160;&#160;&#160;&#160;
      Фильтр&#160;&#160;&#160;&#160;&#160;ИТ&#160;&#160;&#160;&#160;&#160;ГАНК&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;
      <u>&#160;&#160;1 проба&#160;&#160;</u>&#160;&#160;&#160;&#160;&#160;
      <u>&#160;&#160;2 проба&#160;&#160;</u>&#160;&#160;&#160;&#160;&#160;
      <u>&#160;&#160;3 проба&#160;&#160;</u>&#160;&#160;&#160;&#160;&#160;
      <u>&#160;&#160;4 проба&#160;&#160;</u>&#160;&#160;&#160;&#160;&#160;
      <u>&#160;&#160;5 проба&#160;&#160;</u>&#160;&#160;&#160;&#160;&#160;
      <br/><br/>
      ºС:&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;Давление:&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;
      Скорость:&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;Объем:
      <br/><br/>
      Источник:<br/><br/>
    </p>
  </xsl:template>

  <!-- Аэрозоли ПФД-->
  <xsl:template match ="apfd">
    <hr/>
    <p class="factor">
      <b>Аэрозоли ПФД: </b><u><xsl:value-of select="@name"/></u>
      &#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;Дата (№ даты):<br/><br/>
      Подчеркнуть:&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;
      Улица&#160;&#160;&#160;&#160;&#160;С вентиляцией&#160;&#160;&#160;&#160;&#160;Без вентиляции&#160;&#160;&#160;&#160;&#160;
      Фильтр&#160;&#160;&#160;&#160;&#160;ИТ&#160;&#160;&#160;&#160;&#160;ГАНК&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;
      <u>&#160;&#160;1 проба&#160;&#160;</u>&#160;&#160;&#160;&#160;&#160;
      <u>&#160;&#160;2 проба&#160;&#160;</u>&#160;&#160;&#160;&#160;&#160;
      <u>&#160;&#160;3 проба&#160;&#160;</u>&#160;&#160;&#160;&#160;&#160;
      <u>&#160;&#160;4 проба&#160;&#160;</u>&#160;&#160;&#160;&#160;&#160;
      <u>&#160;&#160;5 проба&#160;&#160;</u>&#160;&#160;&#160;&#160;&#160;
      <br/><br/>
      ºС:&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;Давление:&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;
      Скорость:&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;Объем:
      <br/><br/>
      Источник:<br/><br/>
    </p>
  </xsl:template>

  </xsl:stylesheet>